<a href="https://colab.research.google.com/github/epythonlab/PythonLab/blob/master/Top%20Pandas%20Functions.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# How to merge data frames in Pandas?

### To merge DataFrames in Pandas, you can use the `merge()` method. The `merge()` method takes two DataFrames as arguments and returns a new DataFrame that contains the rows from both DataFrames that have matching values in the columns that you specify.

### The following code shows how to merge two DataFrames in Pandas:

In [13]:
import pandas as pd

# Create two DataFrames
df1 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
df2 = pd.DataFrame({'C': [7, 8, 9], 'D': [10, 11, 12]})
df1

   A  B
0  1  4
1  2  5
2  3  6

In [17]:
# Merge the DataFrames on the 'A' column
df_merged = df1.merge(df2, on = 'A')

# Print merged DataFrame
print(df_merged)

KeyError: ignored

As you can see, the `merge()` method returns a new DataFrame that contains the rows from both DataFrames that have matching values in the `A` column.

The `how` argument in pandas `merge()` method is used to specify the type of join to be performed.

The following are the possible values for the `how` argument:

* `inner`: this is the default join type

> it returns the intersection of the rows from both data frames

* `outer`: this returns the union of the rows from both dataframes.

> any rows that do not have a match in the other dataframe will be filled with `nan` values

* `left`: this returns all of the rows from left dataframe, along with any matching rows from the right dataframe.

> any rows that do not have a match in the right dataframe will be filled with `nan` values

* `right`: this returns all of the rows from the right dataframe, along with any matching rows from the left dataframe.

> any rows that do not have a match in the left dataframe will be filled with `nan` values.

# Pandas: Data aggregation with `groupby` and `agg` Functions

In this tutorial, you will learn about how to aggregate data using groupby and agg functions.

As a data scientist, it's common to perform aggregations on datasets to extract valuable insights.

In Python, the pandas library provides powerful tools like data aggregation functions.

`groupby()` is a powerful and versatile function of Python pandas library.

It allows you to split your data into separate groups to perform computations to better analysis.

It allow you to group a DataFrame by one or more columns and perform operations on the resulting groups.

`agg()` is an alias for aggregate . Use the alias.

It enables you to appy aggregation functions to grouped data.

In [ ]:
# import pandas
import pandas as pd
# create a sample dataset
data = pd.DataFrame({'gender': ['male', 'female', 'male', 'female',
                             'male', 'male', 'female', 'female',
                             'male', 'female', 'male', 'male'],
                  'total': [40, 4, 20, 30,
                            30, 12, 23, 34,
                            34, 23, 4, 50]
                  })
# explore the data before aggregation
#data

In [ ]:
# group the data by 'gender' and 
# calculate the sum, mean, and count the number of groups
aggregated_data = data.groupby('gender').agg({
    'total':['sum', 'mean', 'count']
})
aggregated_data

       total
         sum       mean count
gender
female   114  22.800000     5
male     109  15.571429     7

In [ ]:
# reset the index and rename the colums

aggregated_data.reset_index(inplace=True)
aggregated_data.columns = ['gender', 'sum', 'mean', 'count']
aggregated_data

   gender  sum       mean  count
0  female  114  22.800000      5
1    male  109  15.571429      7

# Very Useful Pandas Functions for Everyday Data Analysis

# Pandas `Str accessor`

**Pandas** is a highly efficient library on textual data as well. The functions and methods under the `str accessor` provide flexible ways to filter rows based on strings.

Q1: Lets assume your manager needs empoyee names that the names start with the letter `J` or ends with letter `n`.

Q2. Your manager asked you to bring all the employee names that contains the letter `m` and startswith the letter `J`.


How do you filter the rows from the dataframe?

Most commonly used `str accessors`
1. `startswith()`
2. `endswith()`
3. `contains()`

In [ ]:
# import pandas
import pandas as pd
# read the data from csv
df = pd.read_csv('person_info.csv')
df

               name  birth_date       country
0      Spencer Carr  1937-12-16  South Africa
1        Gary Smith  2002-12-29       Bahrain
2    Jose Wilkinson  1989-05-14      Colombia
3      Robert Smith  2022-06-28  Saint Helena
4  Michelle Simmons  1993-02-10     Gibraltar
5      Kathy Martin  1983-08-05     Argentina
6       Carl Morgan  1993-12-26   Timor-Leste
7  Nicholas Woodard  1938-06-23       Armenia
8      Scott Atkins  1913-12-06       Moldova
9     Janet Pollard  1947-07-09       Ireland

Example 1:

In [ ]:
df[df.name.str.startswith('J') | df.name.str.endswith('n')]

             name  birth_date      country
2  Jose Wilkinson  1989-05-14     Colombia
5    Kathy Martin  1983-08-05    Argentina
6     Carl Morgan  1993-12-26  Timor-Leste
9   Janet Pollard  1947-07-09      Ireland

The `contains()` function under the `str accessor` returns the values that contain a given set of characters.

Example 2:

In [ ]:
df[df.name.str.contains('n') | df.name.str.startswith('J')]

               name  birth_date       country
0      Spencer Carr  1937-12-16  South Africa
2    Jose Wilkinson  1989-05-14      Colombia
4  Michelle Simmons  1993-02-10     Gibraltar
5      Kathy Martin  1983-08-05     Argentina
6       Carl Morgan  1993-12-26   Timor-Leste
8      Scott Atkins  1913-12-06       Moldova
9     Janet Pollard  1947-07-09       Ireland

## Pandas Top Functions to Filtering Rows

### 1. Logical Operator

- You can use the logical operators on column values to filter rows.

In [ ]:
# import pandas
import pandas as pd
# read the data from csv
df = pd.read_csv('person_info.csv')
df

               name  birth_date       country
0      Spencer Carr  1937-12-16  South Africa
1        Gary Smith  2002-12-29       Bahrain
2    Jose Wilkinson  1989-05-14      Colombia
3      Robert Smith  2022-06-28  Saint Helena
4  Michelle Simmons  1993-02-10     Gibraltar
5      Kathy Martin  1983-08-05     Argentina
6       Carl Morgan  1993-12-26   Timor-Leste
7  Nicholas Woodard  1938-06-23       Armenia
8      Scott Atkins  1913-12-06       Moldova
9     Janet Pollard  1947-07-09       Ireland

Fore instance, you can filter the `birht_date >= 1983-01-02`

In [ ]:
df[df.birth_date >= '1983-01-02']

               name  birth_date       country
1        Gary Smith  2002-12-29       Bahrain
2    Jose Wilkinson  1989-05-14      Colombia
3      Robert Smith  2022-06-28  Saint Helena
4  Michelle Simmons  1993-02-10     Gibraltar
5      Kathy Martin  1983-08-05     Argentina
6       Carl Morgan  1993-12-26   Timor-Leste

Only the `birth_date` that greater than the given date is filtered.

### 2. Multiple logical operators
- Pandas allows for combining multiple logical operators. 


For instance, you can apply conditions on both `name` and `birth_date` columns as below.

In [ ]:
df[(df.name > 'John') & (df.birth_date >= '1983-01-02')]

               name  birth_date       country
2    Jose Wilkinson  1989-05-14      Colombia
3      Robert Smith  2022-06-28  Saint Helena
4  Michelle Simmons  1993-02-10     Gibraltar
5      Kathy Martin  1983-08-05     Argentina

Only the name come after 'John' and birth_date that greater than the given date is filtered.

### 3. `isin()` method is the way of applying multiple condition for filtering. 

- For instance, you can filter the names that exist in a given list.

In [ ]:
name_lists = ['Carl Morgan', 'Kathy Martin', 'Scott Atkins']

# filtering the rows that the name exists in the given lists
df[df.name.isin(name_lists)]

           name  birth_date      country
5  Kathy Martin  1983-08-05    Argentina
6   Carl Morgan  1993-12-26  Timor-Leste
8  Scott Atkins  1913-12-06      Moldova

### 4. The `query()` function offers a little more flexibility at writing the conditions for filtering. 

- You~df['name'].isin(name_list can pass the conditions as a string.

For instance, the following code returns the rows that belong to the birth_date between `1983-01-01` and `2022-01-01`

In [ ]:
df.query('birth_date > "1983-01-01" and birth_date < "2022-01-01"')

               name  birth_date      country
1        Gary Smith  2002-12-29      Bahrain
2    Jose Wilkinson  1989-05-14     Colombia
4  Michelle Simmons  1993-02-10    Gibraltar
5      Kathy Martin  1983-08-05    Argentina
6       Carl Morgan  1993-12-26  Timor-Leste

### 5. `tidle(~)`

- The tilde operator is used for `not` logic in filtering.

- If you add the tilde operator before the filter expression, the rows that do not fit the condition are returned.

In [ ]:
# example
df[~df['name'].isin(name_lists)]

               name  birth_date       country
0      Spencer Carr  1937-12-16  South Africa
1        Gary Smith  2002-12-29       Bahrain
2    Jose Wilkinson  1989-05-14      Colombia
3      Robert Smith  2022-06-28  Saint Helena
4  Michelle Simmons  1993-02-10     Gibraltar
7  Nicholas Woodard  1938-06-23       Armenia
9     Janet Pollard  1947-07-09       Ireland

### 5. `Nlargest or nsmallest - in some cases you do not have a specific range for filtering but just need the largest and smallest values

 - `nsmallest` and `nlargest` allows you to filtering rows that have the smalest values or largest values in a column respectively.

### Pandas DataFrame `mask()` vs `where()` Method

The `mask()` method is an application of the `if-then` idiom.

`DataFrame.mask(cond, other=nan, inplace=False, axis=None, level=None, errors='raise', try_cast=NoDefault.no_default)`

- For each element in the calling DataFrame, if `cond` is False the element is used; 
  otherwise the corresponding element from the DataFrame other is used.

### `where()` in Pandas

Pandas `where()` method is used to check a DataFrame for one or more condition and return the result accordingly. 

- By default, the rows not satisfying the condition are filled with `NaN` value.

`DataFrame.where(cond, other=NoDefault.no_default, inplace=False, axis=None, level=None, errors='raise', try_cast=NoDefault.no_default)`

Example: Filter the data where age is greater than 30

In [ ]:
import pandas as pd

data = {
  "age": [50, 40, 30, 40, 20, 10, 30],
  "qualified": [True, False, False, False, False, True, True]
}
df = pd.DataFrame(data)
df

In [ ]:
new_mask = df.mask(df['age'] > 30, axis=0)
new_mask

In [ ]:
df_where = df.where(df['age']>30, axis=0)
df_where.dropna()

 ## `pivot()` vs `pivot_table()`

What is `pivot()` function?

- is used to reshaped a given DataFrame organized by given index / column values.

syntax:
`pandas.pivot(data, index=None, columns=None, values=None)`

Example:

In [ ]:
import pandas as pd
import numpy as np
table = {
        "Item": ['Item0', 'Item0', 'Item1', 'Item1'],
         'CType':['Gold', 'Bronze', 'Gold', 'Silver'],
         'USD': [1, 2, 3, 4],
         'EU':[1.1, 2.2, 3.3, 4.4]
        }

df = pd.DataFrame(table)
df

    Item   CType  USD   EU
0  Item0    Gold    1  1.1
1  Item0  Bronze    2  2.2
2  Item1    Gold    3  3.3
3  Item1  Silver    4  4.4

In such a table, it is not easy to see how the USD price varies over different customer types. You may like to reshape/pivot the table so that all USD prices for an item are on the row to compare more easily.

In [ ]:
pivot_df = df.pivot(index='Item', 
                    columns='CType', 
                    values='USD')
pivot_df

CType  Bronze  Gold  Silver
Item
Item0     2.0   1.0     NaN
Item1     NaN   3.0     4.0

But `pivot()` function does not support data aggregation, multiple values will result in a MultiIndex in the columns.

The `pivot_table()` method comes to solve this problem. It works like pivot, but it aggregates the values from rows with duplicate entries for the specified columns. 

In other words, in the previous example we could have used the mean, the median or another aggregation function to compute a single value from the conflicting entries. 

This is depicted in the example below.

In [ ]:
pivot_df = df.pivot_table(index='Item', 
                          columns='CType',
                          values='USD', 
                          aggfunc=np.min).reset_index()
pivot_df

In [ ]:
data = {'indicator':[1, 2, 3,4, 5, 1, 2, 3, 4, 5],
       'country':['Ethiopia', 'Ethiopia','Ethiopia', 'Ethiopia',
                  'Ethiopia', 'Ethiopia','Ethiopia', 'Ethiopia',
                  'Ethiopia', 'Ethiopia'],
        'year':[2021, 2021, 2021, 2021, 2021, 2022, 2022, 2022, 2022, 2022],
        'value':[6, 13, 10, 11, 5, 3, 2, 7, 3, 6]
    }
df = pd.DataFrame(data)
df

I would like to transpose the table so that the values in the indicator name column are the new columns,

In [ ]:
pd.pivot_table(df, values = 'value', 
               index=['country','year'], 
               columns = 'indicator').reset_index()

In essence `pivot_table` is a generalisation of pivot, which allows you to aggregate multiple values with the same destination in the pivoted table.

## 1: `df.iloc and df.loc`

`df.iloc()` takes as a parameter the `rows and column` indices and gives you the subset of the DataFrame accordingly.

Here, generate dummy data

In [ ]:
import pandas as pd
from faker import Faker

faker = Faker()
"""
Generate fake data which includes
- first_name, last_name, sex, email, birth_date, country
""" 
# create empty dictionary
dummy_data = {'name': [],
              'birth_date':[], 'country':[]}
# iterating over rows and append each data to the dict
for i in range(10):
    dummy_data['name'].append(faker.name())
    dummy_data['birth_date'].append(faker.date_of_birth())
    dummy_data['country'].append(faker.country())

In [ ]:
# explore the data
df = pd.DataFrame(dummy_data)
# save this to csv file
df.to_csv('person_info.csv', index=False)
df

                   name  birth_date      country
0         Emily Andrade  1908-01-19        Tonga
1           Sarah Brown  1999-08-24       Cyprus
2    Christopher Hunter  1942-11-21     Thailand
3  Mrs. Christine Rojas  1961-04-08      Belgium
4        Samantha Lewis  2015-12-13   Luxembourg
5       Jennifer Graham  2000-08-11       Mexico
6     Christopher Ortiz  1935-08-31      Tokelau
7       Jonathon Gibson  2011-09-20  Afghanistan
8        Carmen Johnson  2018-11-29     Colombia
9          Janice Walsh  1956-04-07      Andorra

Here, I am taking the first 4 rows of data and index 1st to index 3rd columns:

In [ ]:
df1 = df.iloc[:, 1:]
df1

   birth_date      country
0  1908-01-19        Tonga
1  1999-08-24       Cyprus
2  1942-11-21     Thailand
3  1961-04-08      Belgium
4  2015-12-13   Luxembourg
5  2000-08-11       Mexico
6  1935-08-31      Tokelau
7  2011-09-20  Afghanistan
8  2018-11-29     Colombia
9  1956-04-07      Andorra

2. `df.loc()`- does almost the similar operation as `.iloc()` function.

But here you can specify exactly which row index you want and also the name of the columns you want in your subset.

Here is an example:

In [ ]:
df.loc[[2, 3, 4], ['name', 'birth_date']]

# 2. `df.insert()`

As the name of the function suggests, it inserts a column in the specified position.

In [ ]:
import pandas as pd

In [ ]:
# read the data
df = pd.read_csv('person_info.csv')

In [ ]:
df

To demonstrate that I will first calculate the age of each person and create list of age that have the same lenght of our DataFrame: